#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.sc_lambda_ondisconnect.aws_lambda_function.lambda will be updated in-place
~ resource "aws_lambda_function" "lambda" {
        arn                            = "arn:aws:lambda:eu-west-1:404273159415:function:sc_ondisconnect_staging"
        filename                       = ".out/lambda-api/ondisconnect.zip"
        function_name                  = "sc_ondisconnect_staging"
        handler                        = "app.handler"
        id                             = "sc_ondisconnect_staging"
        invoke_arn                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:404273159415:function:sc_ondisconnect_staging/invocations"
      ~ last_modified                  = "2019-10-22T16:15:50.668+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-1:404273159415:layer:sc_room_manager_staging:1",
        ] -> (known after apply)
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:eu-west-1:404273159415:function:sc_ondisconnect_staging:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::404273159415:role/sc_lambda_dynamo_staging"
        runtime                        = "nodejs10.x"
      ~ source_code_hash               = "7HWO90/JtQS5ZEbQQ2xyATyGPKOaR/1EP+OHeCZCmzQ=" -> "W4dDheqS439E1znrHouHk0rNQZc5V3+Empvkfktn8XE="
        source_code_size               = 1163
        tags                           = {
            "Application" = "Synchronous chess"
            "Environment" = "staging"
            "Name"        = "Lambda API - ondisconnect"
            "Tool"        = "Terraform"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "FUNCTION_NAME"          = "sc_ondisconnect_staging"
                "TABLE_NAME_CONNECTIONS" = "sc_connections_staging"
                "TABLE_NAME_ROOMS"       = "sc_rooms_staging"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.sc_lambda_sendmessage.aws_lambda_function.lambda will be updated in-place
~ resource "aws_lambda_function" "lambda" {
        arn                            = "arn:aws:lambda:eu-west-1:404273159415:function:sc_sendmessage_staging"
        filename                       = ".out/lambda-api/sendmessage.zip"
        function_name                  = "sc_sendmessage_staging"
        handler                        = "app.handler"
        id                             = "sc_sendmessage_staging"
        invoke_arn                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:404273159415:function:sc_sendmessage_staging/invocations"
      ~ last_modified                  = "2019-10-22T16:16:08.170+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-1:404273159415:layer:sc_room_manager_staging:1",
        ] -> (known after apply)
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:eu-west-1:404273159415:function:sc_sendmessage_staging:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::404273159415:role/sc_lambda_dynamo_staging"
        runtime                        = "nodejs10.x"
      ~ source_code_hash               = "yfOZDKbYXmO4MKw1g5QFnNrwb1/Z1hb0pEt/wcfScks=" -> "ppOKQKe5Sj8CGY/2t9GGHq9d5IDmJgCQFfV03vNKFuM="
        source_code_size               = 17562
        tags                           = {
            "Application" = "Synchronous chess"
            "Environment" = "staging"
            "Name"        = "Lambda API - sendmessage"
            "Tool"        = "Terraform"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "FUNCTION_NAME"          = "sc_sendmessage_staging"
                "TABLE_NAME_CONNECTIONS" = "sc_connections_staging"
                "TABLE_NAME_ROOMS"       = "sc_rooms_staging"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.sc_layer_room_manager.aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                 = "arn:aws:lambda:eu-west-1:404273159415:layer:sc_room_manager_staging:1" -> (known after apply)
        compatible_runtimes = [
            "nodejs10.x",
        ]
      ~ created_date        = "2019-10-22T16:13:44.950+0000" -> (known after apply)
        filename            = ".out/lambda-layers/room_manager.zip"
      ~ id                  = "arn:aws:lambda:eu-west-1:404273159415:layer:sc_room_manager_staging:1" -> (known after apply)
      ~ layer_arn           = "arn:aws:lambda:eu-west-1:404273159415:layer:sc_room_manager_staging" -> (known after apply)
        layer_name          = "sc_room_manager_staging"
      ~ source_code_hash    = "H0yzvUlsXni/0H9XgXDiXCyHkf8GtOeygCSmAp/Uxrs=" -> "ShwOWCP4Dt7TxmijGqRqUK56OvS5XhtdykRNJI/hqOU=" # forces replacement
      ~ source_code_size    = 16502 -> (known after apply)
      ~ version             = "1" -> (known after apply)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>

*Workflow: `Angular CI Pull request Game App`, Action: `hashicorpterraform-github-actions3`*